app/controllers/books_controller.rb

	def index
		@books = Book.all
		@book = Book.new
		@user = User.find_by(id: current_user.id)
---
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@book = Book.new(book_params)
		@book.user = current_user
      @books = Book.all
      @user = User.find_by(id: current_user.id)
	   if @book.save
---
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "4km7e"], ["body", "01mqmnaac74cqvw4cawx"], ["user_id", 2], ["created_at", "2020-06-24 07:49:42.020927"], ["updated_at", "2020-06-24 07:49:42.020927"]]

   def show
    	@books = Book.all
   	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

   def update
   	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]